from django.shortcuts import render


def index(request):
    context = {
        'vue_data': {
            'costs': {
                'Levels': [0, 450, 750, 1100],
                'Forms': [0, 600, 400, 1000],
                'Toppings': [0, 0, 200, 180, 200, 300, 350, 200],
                'Berries': [0, 400, 300, 450, 500],
                'Decors': [0, 300, 400, 350, 300, 200, 280],
                'Words': 500
            },
            'DATA': {
                'Levels': ['не выбрано', '1', '2', '3'],
                'Forms': ['не выбрано', 'Круг', 'Квадрат', 'Прямоугольник'],
                'Toppings': ['не выбрано', 'Без', 'Белый соус', 'Карамельный',
                             'Кленовый', 'Черничный', 'Молочный шоколад',
                             'Клубничный'],
                'Berries': ['нет', 'Ежевика', 'Малина', 'Голубика',
                            'Клубника'],
                'Decors': ['нет', 'Фисташки', 'Безе', 'Фундук', 'Пекан',
                           'Маршмеллоу', 'Марципан']
            },
        }
    }
    return render(request, 'index.html', context)
